SY_Camel2WS/FSW_SalaryUpdate/target/classes/wsdl/SalaryReview.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.example.org/SalaryReview/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="SalaryReview" targetNamespace="http://www.example.org/SalaryReview/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://www.example.org/SalaryReview/">
      <xsd:element name="SalaryReview">
        <xsd:complexType>
          <xsd:sequence>
          	<xsd:element name="name" type="xsd:string" />
          	<xsd:element name="service" type="xsd:int"></xsd:element>
          	<xsd:element name="salary" type="xsd:int"></xsd:element>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="SalaryReviewResponse">
        <xsd:complexType>
          <xsd:sequence>
          	<xsd:element name="name" type="xsd:string" />
          	<xsd:element name="salary" type="xsd:int"></xsd:element>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="SalaryReviewRequest">
    <wsdl:part element="tns:SalaryReview" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="SalaryReviewResponse">
    <wsdl:part element="tns:SalaryReviewResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="SalaryReviewPortType">
    <wsdl:operation name="SalaryReview">
      <wsdl:input message="tns:SalaryReviewRequest"/>
      <wsdl:output message="tns:SalaryReviewResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SalaryReviewBinding" type="tns:SalaryReviewPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="SalaryReview">
      <soap:operation soapAction="http://www.example.org/SalaryReview/SalaryReview"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SalaryReview">
    <wsdl:port binding="tns:SalaryReviewBinding" name="SalaryReviewPort">
      <soap:address location="http://www.example.org/"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
